# FabricationOutOfSizeCondition Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..FabricationOutOfSizeCondition Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
The fabrication part size is not within the correct size range for the service button condition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FabricationOutOfSizeCondition { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationOutOfSizeCondition As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FabricationOutOfSizeCondition {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace